def sortList(content: list):
    content.sort()
    print(content)
    return content


def sortSet(content: set):
    newContent = list(content)
    newContent.sort()
    print(newContent)
    return newContent


def diffSet(s1: set, s2: set):
    newS = s1 ^ s2
    print(newS)
    return newS

def charName():
    names = {}
    names['陆天'] = ''
    names['丁典'] = ''
    names['万震山'] = ''
    names['戚芳'] = ''
    names['狄云'] = ''
    names['万圭'] = ''
    names['万震山'] = ''
    names['凌小姐'] = ''
    names['吴坎'] = ''
    names['宝象'] = ''
    names['戚长发'] = ''
    names['汪啸风'] = ''
    names['马鸣'] = ''
    names['武林'] = ''
    names['。'] = ''
    names['任督'] = ''
    names['两湖'] = ''
    names['任督'] = ''
    names['丁大哥'] = ''
    names['恩公'] = ''
    names['清清'] = ''
    names['火光'] = ''
    names['……'] = ''
    names['王八'] = ''
    names['花铁干'] = ''
    names['虎落'] = ''
    names['观世音'] = ''
    names['金银'] = ''
    names['风虎'] = ''
    names['马大鸣'] = ''
    names['水笙'] = ''
    names['中原'] = ''
    names['周圻'] = ''
    names['喀喇'] = ''
    names['封疆'] = ''
    names['当当'] = ''
    names['斯斯'] = ''
    names['格格'] = ''
    names['水笙'] = ''
    names['汪家'] = ''
    names['熊罴'] = ''
    names['田里'] = ''
    names['言达平'] = ''
    names['豺狼'] = ''
    names['铁锁'] = ''
    names['霜华'] = ''
    names['道'] = ''
    names['沈城'] = ''
    return names


def replaceChar(content: list, old: str, new: str):
    newContent = []
    for i in content:
        if str(i).find(old) > -1:
            i = str(i).replace(old, new)
        newContent.append(i)
    print(newContent)
    return newContent

def filterName(names:dict, name:str):
    for k, v in names.items():
        if name.find(k) > -1 and len(name) > len(k):
            return True
    return False

def filterList(names:dict, content: list):
    newContent = []
    for i in content:
        if len(str(i)) < 2:
            continue
        elif filterName(names, str(i)):
            continue
        else:
            newContent.append(str(i))
    print(newContent)

if __name__ == "__main__":
    names = charName()
    content = ['一天', '丁典', '丁典森', '丁典道', '万圭', '万圭道', '万氏', '万门', '万震山', '万震山哈哈', '万震山道', '卜垣', '周圻', '和生', '宝象浑', '寻思', '戚芳', '戚芳初', '戚芳道', '戚长发', '斜眼', '桃红', '水岱', '水福', '水笙', '水笙初', '水笙嫣然', '水笙道', '江陵', '汪啸风', '火光', '狄云', '狄云初', '狄云初通', '狄云大', '狄云心', '狄云心道', '狄云惊魂', '狄云拙', '狄云松', '狄云气', '狄云眼', '狄云确', '狄云豪兴', '狄云道', '群豪', '群豪中', '耿天霸', '花铁', '花铁干', '花铁干道', '血刀僧', '言达平', '陆天抒', '雪谷', '鲁坤', '一惊', '丁丁', '丁典', '丁典哈哈', '丁典奇', '丁典安', '丁典尸', '丁典疾', '丁典脸', '丁典识', '丁典赤', '丁典道', '丁典飞', '丁名典', '丁大侠', '丁大哥', '丁大哥。', '丁大爷', '丁某', '丁狄', '丁郎', '万圭', '万圭俊', '万圭剑', '万圭剑尖', '万圭当', '万圭微', '万圭神智', '万圭衣', '万圭道', '万家', '万家众', '万家婢仆', '万师伯', '万师兄', '万氏', '万言', '万震山', '万震山。', '万震山伸', '万震山强', '万震山微', '万震山心', '万震山道', '三根香', '东华', '东方', '两湖武林中', '两湖群豪', '两湖豪杰', '严神', '严霜', '中原大豪', '中原群豪', '中原群豪。', '丹阳', '乌龙探海', '乔装', '九泉', '云傍马头生', '云儿', '云哥', '享福', '他勒', '令尊', '任督二脉中川', '众豪', '伤天', '但丁典', '何信义', '余人', '余人均', '余裕', '依依', '侯景', '侯景之乱', '兀鹰', '兀鹰扑', '允饶', '元帝', '光绪', '六刀', '关元', '关铁门', '兵丁先', '典哥', '冯坦', '冯坦道', '凌大人', '凌姑娘', '凌小姐', '凌小姐尸', '凌知府', '凌翰', '凌翰林', '凌辱', '凌退思', '凌霜华', '凛凛', '凝思', '刘三哥', '刘乘风', '刘伯伯', '刘兄弟', '刘坤', '刘水', '刘贤弟', '刘道长', '剑刃', '剑刃平', '剑刃藏', '剑尖', '剑锋', '力丝', '化儿', '化子', '化罗嗦', '千依百顺', '华厦', '卑夷', '南四奇', '卜垣', '卜垣道', '卜师兄', '卜师哥', '卜贤', '卟卟', '卫护', '卿卿', '厉声道', '厉风', '双足', '叮玲玲', '可忒', '可真喜', '右足', '向南', '吕兄弟', '吕大寨', '吕大寨主', '吕威', '吕通', '吴叔叔', '吴坎', '吴坎。', '吴坎哈哈', '吴坎大喜', '吴坎怀', '吴坎来', '吴坎涎', '吴坎笑', '吴坎道', '吴坎齐', '吴师弟', '周二哥', '周兄弟', '周圻', '周圻。', '周圻挺剑', '周圻道', '周圻鼻', '周师哥', '呻吟道', '和生', '哥翁', '啐道', '啷啷', '喀喇', '喀喇喇', '善勇', '喜糕', '圭儿', '圭哥', '圻儿', '坤儿', '塘水', '塞。', '多蒙', '大宝藏', '大恩', '大成。狄', '大石', '大财哪', '大黄', '天明', '天祝祷', '天菩萨', '天非', '奇道', '如来', '妙极', '妞儿', '婢菊友', '字沧珊', '孙受人', '孙均', '孙均一', '孙狄云', '孟子', '孤鸿', '宗周', '宝甲', '宝象', '宝象道', '宝象遥', '宫直', '宾中', '寒霜', '封疆大吏', '小成', '小舟顺江', '山凹里', '山洞角', '山疾驰', '山道谷口', '山风', '崖石', '川中', '左直', '左足', '左镫', '左闪跃', '帆有橹', '师嫂', '平平', '平白', '床帷', '府衙前', '开平生', '张九龄', '张兄', '张老', '强自', '当当', '当当当当', '徒孙儿', '得分明', '心旌', '怩怩', '恩公', '恩公尊', '恩公明鉴', '成俎', '战战兢', '戚前辈', '戚姑娘', '戚师', '戚师傅', '戚师叔', '戚师妹', '戚师弟', '戚师父', '戚老', '戚老三', '戚芳', '戚芳。', '戚芳多', '戚芳心', '戚芳道', '戚长', '戚长发', '戚长发哈哈', '托托', '振臂', '挺剑', '支吾', '教徒弟', '敬狄', '文才', '文清', '文清公', '斯斯文文', '方始', '方明明', '易容', '春归', '曹操', '月光', '朗声', '望远', '机先', '李举', '李举人', '杜甫', '枭道人', '柔声', '柳荫', '栗六', '格格', '格格格格', '桃红', '梁元帝', '梁子', '梁山伯', '梁山泊', '梁朝', '梁武帝', '梅念笙', '梅树', '梅树下', '梅老', '梢公', '楚楚', '武林中', '武林中响当当', '毒蝎螫', '毛羽', '水大侠', '水姑娘', '水小姐', '水岱', '水岱呸', '水岱道', '水氏', '水福', '水福道', '水笙', '水笙原', '水笙微', '水笙悲', '水笙水女侠', '水笙道', '水笙高', '水贤弟', '江心', '江心。宝', '江心涡漩', '江滨', '江铁', '江风', '池潢', '汪啸', '汪啸风', '汪啸风剑', '汪啸风奇道', '汪啸风道', '汪家', '汪家小哥', '汪少侠', '汪少爷', '汪水', '汪贤', '沈城', '沈城。', '沈城哈哈', '沈城大', '沈城笑道', '沈城策', '沈城道', '沈师弟', '沧珊', '波旬', '泥土。', '浩浩', '海云红', '清清楚楚', '火光明亮', '熊罴宁翠微', '爱女', '爱子', '爱洁', '犬欺', '狄……狄', '狄世兄', '狄云', '狄云。', '狄云一棍', '狄云乖儿', '狄云依稀', '狄云全', '狄云兴发', '狄云口', '狄云多', '狄云大', '狄云头', '狄云头颈', '狄云奇道', '狄云微', '狄云心', '狄云心旌', '狄云扼', '狄云曾', '狄云本', '狄云气', '狄云生', '狄云登', '狄云目', '狄云神', '狄云若', '狄云道', '狄兄弟', '狄大侠', '狄大哥', '狄师兄', '狄师哥', '狄弟', '狄戚', '狄某', '狄水', '狄贤', '玉玲珑', '王八蛋', '王屠户', '瑟瑟瑟', '瓜菜阕', '瓦碗', '瓦钵', '甘心', '甘心情', '田里禾秧', '疯汉', '登萍', '白布', '白布缠', '白雪', '百夜恩', '百思', '砰彭', '祝英台', '神智', '神骏', '神龙言达平', '秘奥', '空手相', '竟尔', '端午', '竹板子', '竹棒', '竹箩', '竹篮', '笑道', '笙儿', '策万全', '简文帝', '素帏', '纵跃', '纸蝶', '给水笙', '绸布', '罗帽', '罗里', '群豪', '老丐', '老佛爷', '老王', '老胡', '老贼', '耕田', '耿大爷', '耿天霸', '肩胛', '胜谛', '胡乱', '胡涂', '胡砍', '胡里胡', '自宝', '花伯伯', '花兄', '花大侠', '花大爷', '花某', '花某人', '花贤弟', '花铁', '花铁干', '花铁干依言', '芳儿', '苏属案', '英侠', '荷锄', '莠民', '菊友', '萧绎', '蒋复聪', '蓝绸', '虎落平阳', '蝎子螫', '蝎毒', '螫上', '血刀', '血刀僧', '血刀老祖', '行藏', '西驰', '观世音菩萨', '觉万圭', '言下', '言师伯', '言达平', '言达平坚', '言达平大', '许许多多', '诸葛亮', '谷中', '谷中融雪', '谷口', '豺狼虎豹', '貂蝉', '赖那', '赵兄', '辔徐行', '达平', '连城', '连城剑法', '连城剑诀', '连城剑谱', '连山若布', '连纵', '连芳妹', '通灵', '邓之诚', '郎中', '金掷金', '金星', '金波旬花', '金玉', '金铁', '金铃', '金银财宝', '钱兄', '铁干', '铁栅', '铁栅。', '铁铐', '铁锁横江', '铁镬', '铃剑', '铃剑双侠', '铐镣', '铮铮铮', '银铃', '锋锐', '锦羽', '长江流', '门公', '闻风', '阎王', '防水笙', '阿三', '阿云', '阿芳', '陆伯伯', '陆大侠', '陆大哥', '陆天', '陆天抒', '陆天抒适', '雁翎', '雄健', '雪融', '雪谷', '霜华', '霜华为', '青布', '鞍辔', '鞭丝', '风虎云龙', '飞冰', '飞步', '飞足', '马命风', '马大鸣', '马大鸣马爷', '马来', '马肉', '马臀', '马鞍子', '马鞭', '马鸣风', '马鸣风萧萧', '高飞', '魏兵', '鲁卜', '鲁坤', '鲁大哥', '鸾铃', '黄锈。', '黄马', '黎明', '龙钟委琐']
    filterList(names, content)

